---
kind: method
id: M:Autodesk.Revit.DB.Electrical.ConduitSizeSettings.GetEnumerator
source: html/85207543-4387-b1e5-0db7-0106f0344785.htm
---
# Autodesk.Revit.DB.Electrical.ConduitSizeSettings.GetEnumerator Method

Returns an enumerator that iterates through a collection.

## Syntax (C#)
```csharp
public virtual IEnumerator<KeyValuePair<string, ConduitSizes>> GetEnumerator()
```

## Returns
An IEnumerator object that can be used to iterate through the collection.